Web/app/Controllers/Project.php

SELECT *
FROM `project`
WHERE `project`.`id` = '1'
---
    public function projectUpdate($projectId){
        $data['project'] = $this->projectModel->find($projectId);

SELECT *
FROM `project`
WHERE `project`.`id` = '9'
---
    public function projectDetail($projectId){
        $data['project'] = $this->projectModel->find($projectId);